Autodesk.Revit.DB.DefinitionBindingMap
A map that contains mappings of parameter definitions to parameter bindings.

Autodesk.Revit.DB.DefinitionBindingMap.Insert(Autodesk.Revit.Parameters.Definition,Autodesk.Revit.Parameters.Binding)
System.Int32
Insert the specified binding with the specified definition into the map.
key: The definition to be used for inserting the binding into the map.
item: The binding to be inserted into the map.
Returns: Returns whether the binding was inserted into the map.

Autodesk.Revit.DB.DefinitionBindingMap.GetEnumerator
System.DB.IEnumerator
Retrieve a forward moving iterator to the map.
Returns: Returns a forward moving iterator to the map.

Autodesk.Revit.DB.DefinitionBindingMap.ReverseIterator
Autodesk.Revit.DB.DefinitionBindingMapIterator
Retrieve a backward moving iterator to the map.
Returns: Returns a backward moving iterator to the map.

Autodesk.Revit.DB.DefinitionBindingMap.ForwardIterator
Autodesk.Revit.DB.DefinitionBindingMapIterator
Retrieve a forward moving iterator to the map.
Returns: Returns a forward moving iterator to the map.

Autodesk.Revit.DB.DefinitionBindingMap.Erase(Autodesk.Revit.Parameters.Definition)
System.Int32
Removes a binding with the specified definition from the map.
key: The definition of the binding to be erased.
Returns: The number of bindings that were erased from the map.

Autodesk.Revit.DB.DefinitionBindingMap.Contains(Autodesk.Revit.Parameters.Definition)
System.Boolean
Tests for the existence of a definition within the map.
key: The definition to be searched for.
Returns: The Contains method returns True if the definition is within the map, otherwise False.

Autodesk.Revit.DB.DefinitionBindingMap.Clear
void
Removes every binding from the map, rendering it empty.

Autodesk.Revit.DB.DefinitionBindingMap.Size
System.Int32
get
Returns the number of bindings that are in the map.

Autodesk.Revit.DB.DefinitionBindingMap.Item(Autodesk.Revit.Parameters.Definition)
Autodesk.Revit.Parameters.Binding
Gets or sets a parameter binding for a specified parameter definition within the map.
key: The parameter definition of the binding to be set or retrieved.
Returns: Returns the binding for the specified definition.

Autodesk.Revit.DB.DefinitionBindingMap.IsEmpty
System.Boolean
get
Test to see if the map is empty.
Remarks: If the map is empty then True will be returned, otherwise False.